## Darwish dataset

on_this_earth_raw <- "على هذه الأرض
:علَى هَذِهِ الأَرْض مَا يَسْتَحِقُّ الحَياةْ
تَرَدُّدُ إبريلَ
رَائِحَةُ الخُبْزِ فِي الفجْر
آراءُ امْرأَةٍ فِي الرِّجالِ
كِتَابَاتُ أَسْخِيْلِيوس
أوَّلُ الحُبِّ
عشبٌ عَلَى حجرٍ
أُمَّهاتٌ تَقِفْنَ عَلَى خَيْطِ نايٍ
وخوفُ الغُزَاةِ مِنَ الذِّكْرياتْ
:علَى هَذِهِ الأَرْض مَا يَسْتَحِقُّ الحَياةْ
نِهَايَةُ أَيلُولَ
سَيِّدَةٌ تترُكُ الأَرْبَعِينَ بِكَامِلِ مشْمِشِهَا
 ساعَةُ الشَّمْسِ فِي السَّجْنِ
غَيْمٌ يُقَلِّدُ سِرْباً مِنَ الكَائِنَاتِ
هُتَافَاتُ شَعْبٍ لِمَنْ يَصْعَدُونَ إلى حَتْفِهِمْ بَاسِمينَ
وَخَوْفُ الطُّغَاةِ مِنَ الأُغْنِيَاتْ

:علَى هَذِهِ الأَرْض مَا يَسْتَحِقُّ الحَياةْ
عَلَى هَذِهِ الأرضِ سَيَّدَةُ الأُرْضِ
أُمُّ البِدَايَاتِ أُمَّ النِّهَايَاتِ
كَانَتْ تُسَمَّى فِلِسْطِين
صَارَتْ تُسَمَّى فلسْطِين
 سَيِّدَتي: أَستحِقُّ، لأنَّكِ سيِّدَتِي، أَسْتَحِقُّ الحَيَاةْ

محمود درويش–"

from_there_raw <- "
أنا من هناك. ولي ذكرياتٌ . ولدت كما تولد الناس. لي والدة
وبيتٌ كثير النوافذِ. لي إخوةٌ. أصدقاء. وسجنٌ بنافذة باردهْ.
ولي موجةٌ خطفتها النوارس. لي مشهدي الخاص. لي عشبةٌ زائدهْ
ولي قمرٌ في أقاصي الكلام، ورزقُ الطيور، وزيتونةٌ خالدهْ
مررتُ على الأرض قبل مرور السيوف على جسدٍ حوّلوه إلى مائدهْ.
أنا من هناك. أعيد السماء إلى أمها حين تبكي السماء على أمها،
وأبكي لتعرفني غيمةٌ عائدهْ.
تعلّمتُ كل كلام يليقُ بمحكمة الدم كي أكسر القاعدهْ
تعلّمتُ كل الكلام، وفككته كي أركب مفردةً واحدهْ
…هي: الوطن"

identity_raw <- "
سجل
أنا عربي
ورقم بطاقتي خمسون ألف
وأطفالي ثمانية
وتاسعهم سيأتي بعد صيف
فهل تغضب
سجل أنا عربي
واعمل مع رفاق الكدح في محجر
وأطفالي ثمانية
اسلّ لهم رغيف الخبز والأثواب والدفتر
من الصخر
ولا أتوسل الصدقات من بابك
ولا اصغر أمام بلاط أعتابك
فهل تغضب
سجل
أنا عربي
أنا اسم بلا لقب
صبور في بلاد كل ما فيها
يعيش بفورة الغضب
جذوري
قبل ميلاد الزمان رست
وقبل تفتح الحقب
وقبل السرو والزيتون
وقبل ترعرع العشب
أبي من أسرة المحراث لا من سادة نجب
وجدي كان فلاحا بلا حسب.. ولا نسب
يعلمني شموخ الشمس قبل قراءة الكتب
ويبتي كوخ ناطور من الأعواد والقصب
فلا ترضيك منزلتي ؟
أنا اسم بلا لقب !
سجل أنا عربي
ولون الشعر فحمي ولون العين بني
وميزاتي: على رأسي عقال فوق كوفية
وكفي صلبة كالصخر.. تخمش من يلامسها
وعنواني : أنا من خربة عزلاء…منسية
شوارعها بلا أسماء
وكل رجالها.. في الحقل والمحجر
فهل تغضب؟
سجل… أنا عربي
سلبت كروم أجدادي وأرضا كنت افلحها
أنا وجميع أولادي
ولم تترك لنا ولكل أحفادي
سوى هذي الصخور..
فهل ستأخذها حكومتكم..كما قيلا
إذن !!!!!
سجل…
برأس الصفحة الأولى
أنا لا اكره الناس, ولا أسطو على احد
ولكني… اذا ما جعت, آكل لحم مغتصبي"

darwish_poems <- tibble(
  poet = "محمود درويش",
  poem = c("على هذه الأرض", "أنا من هناك", " بطاقة هوية"),
  text = map_chr(list(on_this_earth_raw, from_there_raw, identity_raw), clean_poem)
)

darwish_lines <- darwish_poems |>
  mutate(lines = map(text, ~ str_split(.x, "\n")[[1]])) |>
  unnest(lines) |>
  rename(line = lines) |>
  group_by(poem) |>
  mutate(line_number = row_number()) |>
  ungroup() |>
  select(poet, poem, line_number, line)
