

library(tidyverse)
library(stringr)


## Arabic normalization function

clean_poem <- function(text){
  
  text <- as.character(text)
  
  text <- stringr::str_remove_all(text, "[\\u064B-\\u065F\\u0670]")  # diacritics
  text <- stringr::str_remove_all(text, "ـ")                         # tatweel
  text <- stringr::str_replace_all(text, "[إأآٱ]", "ا")              # normalize alif
  text <- stringr::str_replace_all(text, "ى", "ي")                   # normalize ya
  text <- stringr::str_replace_all(text, "ة", "ه")                   # normalize ta marbuta
  text <- stringr::str_replace_all(text, "ؤ", "و")
  text <- stringr::str_replace_all(text, "ئ", "ي")
  
  text <- stringr::str_replace_all(text, "[ ]{2,}", " ")             # remove extra spaces
  
  return(text)
}


## RAW POEMS

on_this_earth_raw <- "ض
:علَى هَذِهِ الأَرْض مَا يَسْتَحِقُّ الحَياةْ
تَرَدُّدُ إبريلَ
رَائِحَةُ الخُبْزِ فِي الفجْر
آراءُ امْرأَةٍ فِي الرِّجالِ
كِتَابَاتُ أَسْخِيْلِيوس
أوَّلُ الحُبِّ
عشبٌ عَلَى حجرٍ
أُمَّهاتٌ تَقِفْنَ عَلَى خَيْطِ نايٍ
وخوفُ الغُزَاةِ مِنَ الذِّكْرياتْ
:علَى هَذِهِ الأَرْض مَا يَسْتَحِقُّ الحَياةْ
نِهَايَةُ أَيلُولَ
سَيِّدَةٌ تترُكُ الأَرْبَعِينَ بِكَامِلِ مشْمِشِهَا
 ساعَةُ الشَّمْسِ فِي السَّجْنِ
غَيْمٌ يُقَلِّدُ سِرْباً مِنَ الكَائِنَاتِ
هُتَافَاتُ شَعْبٍ لِمَنْ يَصْعَدُونَ إلى حَتْفِهِمْ بَاسِمينَ
وَخَوْفُ الطُّغَاةِ مِنَ الأُغْنِيَاتْ

:علَى هَذِهِ الأَرْض مَا يَسْتَحِقُّ الحَياةْ
عَلَى هَذِهِ الأرضِ سَيَّدَةُ الأُرْضِ
أُمُّ البِدَايَاتِ أُمَّ النِّهَايَاتِ
كَانَتْ تُسَمَّى فِلِسْطِين
صَارَتْ تُسَمَّى فلسْطِين
 سَيِّدَتي: أَستحِقُّ، لأنَّكِ سيِّدَتِي، أَسْتَحِقُّ الحَيَاةْ

محمود درويش–"

from_there_raw <- "أنا من هناك. ولي ذكرياتٌ . ولدت كما تولد الناس. لي والدة
وبيتٌ كثير النوافذِ. لي إخوةٌ. أصدقاء. وسجنٌ بنافذة باردهْ.
ولي موجةٌ خطفتها النوارس. لي مشهدي الخاص. لي عشبةٌ زائدهْ
ولي قمرٌ في أقاصي الكلام، ورزقُ الطيور، وزيتونةٌ خالدهْ
مررتُ على الأرض قبل مرور السيوف على جسدٍ حوّلوه إلى مائدهْ.
أنا من هناك. أعيد السماء إلى أمها حين تبكي السماء على أمها،
وأبكي لتعرفني غيمةٌ عائدهْ.
تعلّمتُ كل كلام يليقُ بمحكمة الدم كي أكسر القاعدهْ
تعلّمتُ كل الكلام، وفككته كي أركب مفردةً واحدهْ
…هي: الوطن"

identity_raw <- "سجل
أنا عربي
ورقم بطاقتي خمسون ألف
وأطفالي ثمانية
وتاسعهم سيأتي بعد صيف
فهل تغضب
سجل أنا عربي
واعمل مع رفاق الكدح في محجر
وأطفالي ثمانية
اسلّ لهم رغيف الخبز والأثواب والدفتر
من الصخر
ولا أتوسل الصدقات من بابك
ولا اصغر أمام بلاط أعتابك
فهل تغضب
سجل
أنا عربي
أنا اسم بلا لقب
صبور في بلاد كل ما فيها
يعيش بفورة الغضب
جذوري
قبل ميلاد الزمان رست
وقبل تفتح الحقب
وقبل السرو والزيتون
وقبل ترعرع العشب
أبي من أسرة المحراث لا من سادة نجب
وجدي كان فلاحا بلا حسب.. ولا نسب
يعلمني شموخ الشمس قبل قراءة الكتب
ويبتي كوخ ناطور من الأعواد والقصب
فلا ترضيك منزلتي ؟
أنا اسم بلا لقب !
سجل أنا عربي
ولون الشعر فحمي ولون العين بني
وميزاتي: على رأسي عقال فوق كوفية
وكفي صلبة كالصخر.. تخمش من يلامسها
وعنواني : أنا من خربة عزلاء…منسية
شوارعها بلا أسماء
وكل رجالها.. في الحقل والمحجر
فهل تغضب؟
سجل… أنا عربي
سلبت كروم أجدادي وأرضا كنت افلحها
أنا وجميع أولادي
ولم تترك لنا ولكل أحفادي
سوى هذي الصخور..
فهل ستأخذها حكومتكم..كما قيلا
إذن !!!!!
سجل…
برأس الصفحة الأولى
أنا لا اكره الناس, ولا أسطو على احد
ولكني… اذا ما جعت, آكل لحم مغتصبي"

jerusalem_raw <- c("لقدس، أَعني داخلَ السُّور القديمِ،
أَسيرُ من زَمَنٍ إلى زَمَنٍ بلا ذكرى
تُصوِّبُني. فإن الأنبياءَ هناك يقتسمون
تاريخَ المقدَّس… يصعدون إلى السماء
ويرجعون أَقلَّ إحباطاً وحزناً، فالمحبَّةُ
والسلام مُقَدَّسَان وقادمان إلى المدينة.
كنت أَمشي فوق مُنْحَدَرٍ وأَهْجِسُ: كيف
يختلف الرُّواةُ على كلام الضوء في حَجَرٍ؟
أَمِنْ حَجَر ٍشحيحِ الضوء تندلعُ الحروبُ؟
أسير في نومي. أَحملق في منامي. لا
أرى أحداً ورائي. لا أرى أَحداً أمامي.
كُلُّ هذا الضوءِ لي. أَمشي. أخفُّ. أطيرُ
ثم أَصير غيري في التَّجَلِّي. تنبُتُ
الكلماتُ كالأعشاب من فم أشعيا
النِّبَويِّ: ((إنْ لم تُؤْمنوا لن تَأْمَنُوا)).
أَمشي كأنِّي واحدٌ غيْري. وجُرْحي وَرْدَةٌ
بيضاءُ إنجيليَّةٌ. ويدايَ مثل حمامتَيْنِ
على الصليب تُحلِّقان وتحملان الأرضَ.
لا أمشي، أَطيرُ، أَصيرُ غَيْري في
التجلِّي. لا مكانَ و لا زمان . فمن أَنا؟
أَنا لا أنا في حضرة المعراج. لكنِّي
أُفكِّرُ: وَحْدَهُ، كان النبيّ محمِّدٌ
يتكلِّمُ العربيَّةَ الفُصْحَى. ((وماذا بعد؟))
ماذا بعد؟ صاحت فجأة جنديّةٌ:
هُوَ أَنتَ ثانيةً؟ أَلم أَقتلْكَ؟
قلت: قَتَلْتني… ونسيتُ، مثلك، أن أَموت")

olivetree_raw <- c("شجرة الزيتون لا تبكي ولا تضحك .هي
سيدة السفوح المحتشمة .بظلها تغطي
ساقها ،ولا تخلع أوراقها أمام عاصفة.
تقف كأنها جالسة،وتجلس كأنها واقفة.
تحيا أختاً لأبدية أليفة وجارة لزمن
يعيها على تخزين الزيت النوراني وعلى
نسيان أسماء الغزاة،ما خلا الرومان
الذين عاصروها واستعاروا بعض أغصانها
لضفر الأكاليل.لم يعاملوها كأسيرة حرب ،
بل كجدة محترمة ينكسر السيف أمام
وقارها النبيل .في فضة حضرتها المتقشفة
خفر اللون من الإفصاح ،والنظر إلى ما
وراء الوصف ،فلا هي خضراء ولا فضية .
هي لون السلام إذا احتاج السلام إلى فصيلة
لون .لا يقول لها أحد :كم أنتي جميلة !
لكنه يقول:كم أنت نبيلة وجليلة .وهي,
هي التي تدرّب الجنود على نزع البنادق,
وتمرنهم على الحنين والتواضع:عودوا إلى
                   بيوتكم, وأضيئوا بزيتي القناديل. لكن
هؤلاء الجنود, هؤلاء الجنود الجدد,
يحاصرونها بالجرافات ويجتثونها من سلالة
الأرض .....ينتصرون على جدتنا التي انقلبت
وصار فرعها في الأرض وجذورها في السماء.
لم تبك ولم تصرخ .إلا أن أحد
أحفادها ممن شاهدوا عملية الإعدام ،رمى
جندياً بحجر، واستشهد معها ، وعندما مضى
الجنود منتصرين , دفناه هناك :في الحفرة
العميقة _مهد الجدة .ولسبب ما ،كنا
متأكدين من أنه سيصبح ،بعد قليل ،شجرة
زيتون ... شجرة زيتون شائكة ....وخضراء!")

mother_raw <- c("حنّ إلى خبز أمي
و قهوة أمي
و لمسة أمي
و تكبر في الطفولة
يوما على صدر يوم
و أعشق عمري لأني
إذا متّ ،
أخجل من دمع أمي!
خذيني ، إذا عدت يوما
وشاحا لهدبك
و غطّي عظامي بعشب
تعمّد من طهر كعبك
و شدّي وثاقي ..
بخصلة شعر
بخيط يلوّح في ذيل ثوبك ..
عساي أصير إلها
إلها أصير ..
إذا ما لمست قرارة قلبك !
ضعيني ، إذا ما رجعت
وقودا بتنور نارك ..
وحبل غسيل على سطح دارك
لأني فقدت الوقوف
بدون صلاة نهارك .
هرمت ، فردّي نجوم الطفولة
حتى أشارك
صغار العصافير
درب الرجوع ..
لعشّ انتظارك")

rita_rifle_raw <- c("ريتا و البندقية
بين ريتا وعيوني . . بندقيه
والذي يعرف ريتا ينحني
ويصلي
لإله في العيون العسليه
وأنا قبلت ريتا
عندما كانت صغيره
وأنا أذكر كيف التصقت
بي وغطت ساعدي أحلى ضفيره
وأنا أذكر ريتا
مثلما يذكر عصفور غديره
آه ريتا
بيننا مليون عصفور وصوره
ومواعيد كثيره
أطلقت نارا عليها . . بندقيه
إسم ريتا كان عيدا في فمي
جسم ريتا كان عرسا في دمي
وأنا ضعت بريتا . . سنتين
وهي نامت فوق زندي سنتين
وتعاهدنا على أجمل كأس واحترقنا
في نبيذ الشفتين
وولدنا مرتين
آه . . ريتا
أي شيء رد عن عينيك عيني
سوى إغفاءتين
وغيوم عسليه
قبل هذي البندقيه
كان يا ما كان
يا صمت العشيه
قمري هاجر في الصبح بعيدا
في العيون العسليه
والمدينة
كنست كل المغنين وريتا
بين ريتا وعيوني . . بندقيه")

deadsea_raw <- c("لا باب يفتحه امامي البحر..
قلت قصيدتي
حجر يطير الى ابي حجلا. اتعلم يا ابي
ماحل بي? لا باب يغلقه علي البحر, لا
مراة اكسرها لينتشر الطريق حصى.. امامي
او زبد...
هل من احد..
يبكي على احد لاحمل نا يه
عنه, واظهر مات بطن من حطامي?
انا من رعاة الملح في الاغوار. ينقر طائر
لغتي, ويبني عش زرقت ه المب عثر في خيامي..
هل من بلد
ينسل مني كي اراه, كما اريد، وكي يراني
في الشاطئ الغربي من نفسي على حجر الابد?
هذا غيابك كله شجر, يطل عليك منك ومن دخاني
نامت اريحا تحت نخلتها القديمة, لم اجد
احدا يهز سريرها: هدات قوافلهم فنامي..
وبحثت لاسمي عن اب لاسمي, فشقنني عصا
سحرية, قتلاي ام رؤياي تطلع من منامي?
الانبياء جميعهم اهلي, ولكن السماء بعيدة
عن ارضها, وانا بعيد عن كلامي..
لا ريح ترفعني الى اعلى من الماضي هنا
لا ريح ترفع موجة عن ملح هذا البحر, لا
رايات للمو تى لكي يستسلموا فيها, ولا
اصوات للاحياء كي يتبادلوا خطب السلام..
والبحر يحمل ظلي الفضي عند الفجر،
يرشدني الى
كلماتي الاولى لثدي المراة
الاولى, ويحيا ميتا
في رقصة الوثني حول فضائه،
ويموت حيا في ثنايي القصيدة والحسام,
ما بين مصر وبين اسيا والشمال.. فيا غريب
اوقف حصانك تحت نخلتنا! على طرق الشام
يتبادل الغرباء في ما بينهم خوذا سينبت فوقها
حبق يوزعه على الدنيا حمام قد يهب من البيوت
والبحر مات, من الرتابة, في وصايا لا تموت
وانا انا, ان كنت انت هناك انت, انا الغريب
عن نخلة الصحراء منذ ولدت في هذا الزحام
وانا انا, حرب علي وفي حرب.. ياغريب
علق سلاحك فوق نخلتنا, لازرع حنطتي
في حقل كنعان المقدس.. خذ نبيذا من جراري
خذ صفحة من سفر الهتي.. وقسطا من طعامي
وخذ الغزالة من فخاخ غنائنا الرعوي, خذ
صلوات كنعانية في عيد كرمتها, وخذ عاداتنا
في الري, خذ منا دروس البيت. ضع
حجرا من الاجر, وارفع فوقه برج الحمام
لتكون منا ان اردت, وجار حنطتنا وخذ
منا نجوم الابجدية, ياغريب
واكتب رسالات السماء معي الى
خوف الشعوب من الطبيعة والشعوب،
واترك اريحا تحت نخلتها, ولاتسرق منامي
وحليب امراتي, وقوت النمل في جرح الرخام!
اتيت... ثم قتلت.. ثم ورثت, كي
يزداد هذا البحر ملحا?
وانا انا اخضر عاما بعد عام فوق جذع السنديان
هذا انا, وانا انا, هنا مكاني في مكاني
والان في الماضي اراك, كما اتيت, ولا تراني
والان في الماضي اضيء لحاضري
غده.. فيناى بي زماني عن مكاني
حينا, ويناى بي مكاني عن زماني
والانبياء جميعهم اهلي, ولكن السماء بعيدة
عن ارضها, وانا بعيد عن كلامي
والبحر ينزل تحت سطح البحر كي تطفو عظامي
شجرا. غيابي كله شجر. وبابي ظله
قمر. وكنعانية امي. وهذا البحر جسر ثابت
لعبور ايام القيامة يا ابي كم مرة
ساموت فوق فراش امراة الاساطير التي
تختارها  لي, فتشب نار في الغمام
كم مرة ساموت في نعناع احواضي القديمة كلما
فركته ريح شمالك العالي رسائل من يمام?
هذا غيابي سيد يتلو شرايعه على
احفاد لوط, ولا يرى لسدوم مغفرة سواي
هذا غيابي سيد يتلو شرايعه, ويسخر من رءاي
ما قيمة المراة للمراة ? لي وجه عليك, وانت لا
تصحو من التاريخ, لا تمحو بخار البحر عنك..
والبحر, هذا البحر, اصغر من خرافته واصغر من يديك
هو برزخ البلور, اوله كاخره, ولا معنى هنا
لدخولك العبثي في اسطورة تركت جيوشا للركام
ليمر جيش اخر يروي روايته ويحفر لاسمه
جبلا, وياتي ثالث ويخط سيرة زوجة خانت, ويمحو رابع
اسماء من سبقوا هناك لكل جيش شاعر
ومؤرخ, وربابة للراقصات الساخرات من البداية والختام...
سدى افتش عن غيابي, فهو ابسط من حمير
الانبياء تمر فوق السفح حاملة سماء للانام..
والبحر, هذا البحر, في متناول الايدي سامشي فوقه
واسك فضته, واطحن ملحه بيدي هذا البحر لا
يحتله احد. اتى كسرى وفرعون وقيصر والنجاشي
والاخرون, ليكتبوا اسماءهم, بيدي, على الواحه
فكتبت: لاسمي الارض, واسم الارض الهة تشاركني مقامي
في المقعد الحجري. لم اذهب ولم ارجع مع الزمن الهلامي
وانا انا, ولو انكسرت.. رايت ايامي امامي
ذهبا على اشجاري الاولى, رايت ربيع امي, يا ابي
ورايت ريشتها تطرز طائرين: لشالها, ولشال اختي
وفراشة لم تحترق بفراشة من اجلنا, ورايت لاسمي
جسدا: انا ذكر الحمام يئن في انثى الحمام.
ورايت منزلنا المؤثث بالنبات, رايت بابا للدخول
ورايت بابا للخروج, رايت بابا للخروج وللدخول..
هل مر نوح من هناك الى هناك لكي يقول
ما قال في الدنيا: لها بابان مختلفان, لكن الحصان يطير بي
ويطير بي اعلى واسقط موجة جرحت سفوحا, يا ابي
وانا انا ولو انكسرت, رايت ايامي امامي
ورايت هاوية, رايت الحرب بعد الحرب, تلك قبيلة
دالت, وتلك قبيلة قالت لهولاكو المعاصر: نحن لك
واقول: لسنا امة امة, وابعث لابن خلدون احترامي
وانا انا ولو انكسرت على الهواء المعدني.. واسلمتني
حرب الصليبي الجديد الى اله الانتقام
والى المغولي المرابط خلف اقنعة الامام
والى نساء الملح في اسطورة نخرت عظامي..
وانا انا, لا باب يغلقه علي البحر. لا
مراة اكسرها لتنتشر الطريق رؤى.. امامي
والانبياء جميعهم اهلي, ولكن السماء بعيدة عن
ارضها, وانا بعيد عن كلامي..")

ghost_raw <- c("اطل, كشرفة بيت, على ما اريد
اطل على اصدقائي وهم يحملون بريد
المساء: نبيذا وخبزا,
وبعض الروايات والاسطوانات ...

اطل على نورس, وعلى شحنات جنود
تغير اشجار هذا المكان.
اطل على كلب جاري المهاجر
من كندا,منذ عام ونصف...

اطل على اسم ,
المسافر من طبريا الي مصر
فوق حصان النشيد

اطل علي الوردة الفارسية تصعد
فوق سياج الحديد

اطل على الوردة الفارسية تصعد
فوق سياج الحديد

اطل, كشرفة بيت , على ما اريد

اطل على شجر يحرس الليل من نفسه
ويحرس نوم الذين يحبونني ميتا ...

اطل علي الريح تبحث عن وطن الريح
في نفسها ...
اطل على امراة تتشمس في نفسها ...

اطل على موكب الانبياء القدامى
وهم يصعدون حفاة الى اورشليم
واسال: هل من نبي جديد
لهذا الزمان الجديد؟
اطل, كشرفة بيت, على ما اريد

اطل علي صورتي وهي تهرب من نفسها
الي السلم الحجري, وتحمل منديل امي
وتخفق في الريح: ماذا سيحدث لو عدت
طفلا؟ وعدت اليك ... وعدت الي

اطل علي جذع زيتونة خبات زكريا
اطل علي المفردات التي انقرضت في 
اطل علي الفرس والروم, والسومريين,
واللاجئين الجدد...

اطل على عقد احدى فقيرات طاغور
تطحنه عربات الامير الوسيم...

اطل على هدهد مجهد من عتاب الملك

اطل على ما وراء الطبيعة:

ماذا سيحدث ... ماذا سيحدث بعد الرماد؟

اطل على جسدي خائفا من بعيد...

اطل, كشرفة بيت, على ما اريد

اطل على لغتي بعد يومين. يكفي غياب

قليل ليفتح اسخيلوس الباب للسلم,
يكفي
خطاب قصير ليشعل انطونيو الحرب,

تكفي

يد امراة في يدي

كي اعانق حريتي

وان يبدا المد والجزر في جسدي من جديد

اطل, كشرفة بيت, على ما اريد

اطل على شبحي
قادما
من
بعيد...")

wall_raw <- c("افعى معدنية ضخمة تلتف حولنا . تبتلع
جدراننا الصغيرة الفاصلة بين غرفة النوم
والحمام والمطبخ وغرفة الاستقبال . افعى
لا تسعى بخط مستقيم لئلا تتشبه
بنظراتنا الى امام . تتلوى وترفع كابوسها
المصنوع من فقرت اسمنت مقوى بحديد
مرن... يسهل عليها الحركة الى ما تبقى
لنا من فتات جهات واحواض نعناع .
افعى تسعى لوضع بيضها بين زفيرنا
والشهيق : لنقول مرة واحدة : نحن ,
من فرط نختنق , نحن الغرباء .
ننظر في مرايانا فلا نرى غير اقتراب الافعى
من اعناقنا . لكننا , وبقليل من جهد
الرؤيا , ما فوقها : نرى سماء
تتثاءب ضجرا من مهندسين يسقفونها
بالبنادق والبيارق . ونراها في الليل
تتلالا بكواكب تحدق الينا بحنان . ونرى
ايضا ما خلف جدار الافعى : نرى
حراس الچيتو خائفين مما نفعل خلف
ما تبقى لنا من جداران صغيرة ... نراهم
يزيتون اسلحتهم لقتل العنقاء التي
ظنوها تختبئ عندنا , في قن دجاج .
فلا نملك الا ان نضحك !")


## Dataset Construction


darwish_poems <- tibble(
  
  poet = "محمود درويش",
  
  poem = c(
    "على هذه الأرض",
    "أنا من هناك",
    "بطاقة هوية",
    "في القدس",
    "شجرة الزيتون",
    "إلى أمي",
    "ريتا والبندقية",
    "حجر كنعاني في البحر الميت",
    "أرى شبحي قادماً من بعيد",
    "الجدار"
  ),
  
  text = map_chr(
    list(
      on_this_earth_raw,
      from_there_raw,
      identity_raw,
      jerusalem_raw,
      olivetree_raw,
      mother_raw,
      rita_rifle_raw,
      deadsea_raw,
      ghost_raw,
      wall_raw
    ),
    clean_poem
  )
  
) |>
  mutate(poem_id = row_number())


## Convert poems into line-level dataset


darwish_lines <- darwish_poems |>
  
  mutate(lines = map(text, ~ str_split(.x, "\n")[[1]])) |>
  
  unnest(lines) |>
  
  rename(line = lines) |>
  
  group_by(poem) |>
  
  mutate(line_number = row_number()) |>
  
  ungroup() |>
  
  select(poem_id, poet, poem, line_number, line)


